Repository: pypi-data/pypi-mirror-369
Catalog: packages/file-conversor/file_conversor-0.3.2.tar.gz/file_conversor-0.3.2/src/file_conversor/.locales/*/LC_MESSAGES/messages.po
Languages: pt_br

source: not found in PATH environment
pt_br: nao encontrado no ambiente PATH

source: found
pt_br: encontrado

source: File
pt_br: Arquivo

source: not found
pt_br: nao encontrado

source: Missing dependencies detected
pt_br: Dependências ausentes detectadas

source: Install package manager for the current user?
pt_br: Instalar o gerenciador de pacotes para o usuário atual?

source: Package Manager Installation
pt_br: Instalação do Gerenciador de Pacotes

source: SUCCESS
pt_br: SUCESSO

source: Install missing dependencies for the current user?
pt_br: Instalar dependencias ausentes para o usuário atual?

source: External Dependencies Installation
pt_br: Instalacao de Dependencias Externas

source: Pipeline stage created at
pt_br: Etapa da pipeline criada em

source: Config file saved at
pt_br: Arquivo de configuração salvo em

source: Config file
pt_br: Arquivo de configuração

source: does not exist
pt_br: não existe

source: Loading
pt_br: Carregando

source: Found
pt_br: Encontrado

source: stages
pt_br: etapas

source: Processing stage
pt_br: Processando arquivo

source: Executing batch stage
pt_br: Executando etapa em lote

source: Stage
pt_br: Etapa

source: Processing files
pt_br: Processando arquivo

source: FAILED
pt_br: FALHOU

source: Finished batch stage
pt_br: Etapa em lote finalizada

source: Invalid quality level. Valid values are
pt_br: Nível de qualidade inválido. Os valores válidos são

source: Utils and Config
pt_br: Utilitários e Configuração

source: Multimedia files
pt_br: Arquivos multimídia

source: Audio / Video file manipulation (requires FFMpeg external library)
pt_br: Comandos de manipulação de áudio/vídeo (requer biblioteca externa FFMpeg)

source: Image file manipulation
pt_br: Comandos de manipulação de imagens

source: PDF file manipulation
pt_br: Comandos de manipulação de arquivos PDF

source: Windows OS commands (for Windows ONLY)
pt_br: Comandos para o sistema operacional Windows (somente para Windows)

source: The batch processing pipeline works by monitoring an input folder, passing those files to the next pipeline stage, and processing them inside that stage. This process continues (output of the current stage is the input of the next stage), until those files reach the end of the pipeline.
pt_br: A pipeline de processamento em lote funciona monitorando uma pasta de entrada, passando os arquivos para a próxima etapa da pipeline e processando-os dentro dessa etapa. Esse processo continua (a saída da etapa atual é a entrada da próxima etapa), até que os arquivos alcancem o final da pipeline.

source: Example
pt_br: Exemplo

source: Input folder
pt_br: Caminho da pasta de entrada

source: Stage 1
pt_br: Etapa 1

source: Stage 2
pt_br: Etapa 2

source: Output Folder
pt_br: Caminho da pasta de saída

source: Configure default options
pt_br: Configurar opções padrão

source: Show the application help
pt_br: Mostrar ajuda da aplicação

source: Features
pt_br: Funcionalidades

source: Compress image / audio / video / pdf files
pt_br: Comprimir arquivos de imagem / áudio / vídeo / pdf

source: Convert image / audio / video / pdf files
pt_br: Converter arquivos de imagem / áudio / vídeo / pdf

source: Batch file processing, for task automation using scripts
pt_br: Processmento de arquivos em lotes, para automacao de tarefas usando scripts

source: Supports various input and output formats
pt_br: Suporta vários formatos de entrada e saída

source: Configure default options for conversion / compression
pt_br: Configurar opções padrão para conversão/compressão

source: Installs external dependencies automatically (using package managers)
pt_br: Instala dependencias externas automaticamente (usando gerenciadores de pacotes)

source: For more information, visit
pt_br: Para mais informações, visite

source: Disable file logs
pt_br: Desativar arquivos de log

source: Disable progress bars
pt_br: Desativar barras de progresso

source: Enable quiet mode (only display errors and progress bars)
pt_br: Ativar modo quieto (mostra paenas erros e barras de progresso)

source: Enable verbose mode
pt_br: Ativar saída detalhada

source: Enable debug mode
pt_br: Ativar modo de depuracao (debug)

source: Command
pt_br: Comando

source: Get information about a audio/video file.
pt_br: Obter informações sobre um arquivo de áudio/vídeo.

source: This command retrieves metadata and other information about the audio / video file
pt_br: Este comando recupera metadados e outras informações sobre o arquivo de áudio/vídeo

source: Format
pt_br: Formato

source: Duration
pt_br: Duração

source: Other properties
pt_br: Outras propriedades

source: Examples
pt_br: Exemplos

source: Parsing file metadata
pt_br: Processando arquivo

source: File Information
pt_br: Para mais informações, visite

source: Name
pt_br: Nome

source: Size
pt_br: Tamanho

source: Bitrate
pt_br: Taxa de bits (bitrate)

source: Media Streams
pt_br: Faixas de media (streams)

source: Stream
pt_br: Faixa de media

source: Resolution
pt_br: Resolucao

source: Sampling rate
pt_br: Taxa de amostragem

source: Channels
pt_br: Canais

source: Chapters
pt_br: Capitulos

source: Time
pt_br: Tempo

source: File Analysis
pt_br: Analise do Arquivo

source: Convert a audio/video file to a different format.
pt_br: Converter um arquivo de áudio/vídeo para um formato diferente.

source: This command can be used to convert audio or video files to the specified format.
pt_br: Este comando pode ser usado para converter arquivos de áudio ou vídeo para o formato especificado.

source: Input file
pt_br: Caminho do arquivo de entrada

source: Output file
pt_br: Caminho do arquivo de saída

source: Audio bitrate in kbps
pt_br: Taxa de bits do áudio em kbps

source: Video bitrate in kbps
pt_br: Taxa de bits do vídeo em kbps

source: Processing file
pt_br: Processando arquivo

source: FFMpeg convertion
pt_br: Conversão FFMpeg

source: Creates a batch file processing pipeline (for tasks automation).
pt_br: Cria um pipeline de processamento em lotes (para automacao de tarefas)

source: Will ask questions interactively to create a batch file processing pipeline.
pt_br: Fará perguntas interativamente para criar um pipeline de processamento de arquivos em lote.

source: Placeholders available for commands
pt_br: Marcadores disponíveis para comandos

source: Replaced by the first file path found in pipeline stage.
pt_br: Substituído pelo primeiro caminho de arquivo encontrado na etapa do pipeline.

source: The name of the input file.
pt_br: O nome do arquivo de entrada.

source: The extension of the input file.
pt_br: A extensão do arquivo de entrada.

source: The directory of the input path (previous pipeline stage).
pt_br: A pasta do arquivo de entrada (etapa anterior do pipeline).

source: The directory of the output path (current pipeline stage).
pt_br: A pasta do arquivo de saída (etapa atual do pipeline).

source: Creating batch pipeline
pt_br: Criando pipeline de processamento em lote

source: Name of the batch pipeline folder (e.g., %USERPROFILE%/Desktop/pipeline_name_here)
pt_br: Nome da pasta do pipeline de processamento em lote (exemplo: %USERPROFILE%/Desktop/nome_do_pipeline_aqui)

source: Name of the processing stage (e.g., image_convert)
pt_br: Nome da etapa de processamento (exemplo: image_convert)

source: Type command here
pt_br: Digite o comando aqui

source: e.g.
pt_br: exemplo:

source: Need another pipeline stage
pt_br: Precisa de outra etapa no pipeline?

source: Batch creation
pt_br: Criação de batch

source: Execute batch file processing pipeline.
pt_br: Executar o pipeline de processamento de arquivos em lote.

source: Pipeline folder
pt_br: Pasta do pipeline

source: Batch execution
pt_br: Execução do batch

source: Show the current configuration of the application
pt_br: Mostrar a configuração atual da aplicação

source: Configuration
pt_br: Configuração

source: Configure the default options for the file converter.
pt_br: Configurar as opções padrão para o conversor de arquivos.

source: Install missing external dependencies action. 'True' for auto install. 'False' to not install missing dependencies. 'None' to ask user for action.
pt_br: Ação para instalar dependências externas ausentes. 'True' para instalar automaticamente. 'False' para não instalar dependências ausentes. 'None' para pedir ao usuário a ação a ser tomada.

source: Image quality (for ``image convert`` command). Valid values are between 1-100.
pt_br: Qualidade da imagem (para o comando ``image convert``). Valores válidos são entre 1-100.

source: Image quality in dots per inch (DPI) (for ``image to_pdf`` command). Valid values are between 40-3600.
pt_br: Qualidade da imagem em pontos por polegada (DPI) (para o comando ``image to_pdf``). Valores válidos são entre 40-3600.

source: Image fit (for ``image to_pdf`` command). Valid only if ``--page-size`` is defined. Valid values are 'into', or 'fill'. Defaults to 'into'.
pt_br: Ajuste da imagem (para o comando ``image to_pdf``). Válido apenas se ``--page-size`` estiver definido. Valores válidos são 'into' ou 'fill'. O valor padrão é 'into'.

source: Page size (for ``image to_pdf`` command). Format (width, height). Other valid values are: 'a4_portrait', 'a4_landscape'. Defaults to None (PDF size = image size).
pt_br: Tamanho da página (para o comando ``image to_pdf``). Formato (largura, altura). Outros valores válidos são: 'a4_portrait', 'a4_landscape'. O valor padrão é None (tamanho do PDF = tamanho da imagem).

source: Set PDF metadata (for ``image to_pdf`` command). Defaults to True (set creator, producer, modification date, etc).
pt_br: Definir metadados do PDF (para o comando ``image to_pdf``). O valor padrão é True (define criador, produtor, data de modificação, etc).

source: Installs context menu for all users. Defaults to False (install only for current user).
pt_br: Instala o menu de contexto para todos os usuários. O valor padrão é False (instalar apenas para o usuário atual).

source: Configuration file
pt_br: Arquivo de configuração

source: updated
pt_br: atualizado

source: Get EXIF information about a image file.
pt_br: Obter informações EXIF sobre um arquivo de áudio/vídeo.

source: This command retrieves metadata and other information about the image file
pt_br: Este comando recupera metadados e outras informações sobre o arquivo de áudio/vídeo

source: Convert a list of image files to one PDF file, one image per page.
pt_br: Converter uma lista de arquivos de imagem em um único arquivo PDF, uma imagem por página.

source: Valid only if ``--page-size`` is defined. Otherwise, PDF size = figure size.
pt_br: Válido apenas se ``--page-size`` estiver definido. Caso contrário, o tamanho do PDF = tamanho da imagem.

source: Figure adjusted to fit in PDF size
pt_br: Figura ajustada para caber no tamanho do PDF

source: without any empty borders (cut figure if needed)
pt_br: sem bordas vazias (corta a figura se necessário)

source: Input files
pt_br: Caminho do arquivo de entrada

source: Defaults to None
pt_br: O valor padrão é Nenhum

source: use the same 1st input file as output name
pt_br: usar o mesmo nome do primeiro arquivo de entrada como nome de saída

source: Image quality in dots per inch (DPI). Valid values are between 40-3600.
pt_br: Qualidade da imagem em pontos por polegada (DPI). Os valores válidos estão entre 40-3600.

source: Image fit. Valid only if ``--page-size`` is defined. Valid values are 'into', or 'fill'. Defaults to 'into'.
pt_br: Ajuste da imagem. Válido apenas se ``--page-size`` estiver definido. Os valores válidos são 'into' ou 'fill'. O valor padrão é 'into'.

source: Page size. Format '(width, height)'. Other valid values are: 'a4', 'a4_landscape'. Defaults to None (PDF size = image size).
pt_br: Tamanho da página. Formato '(largura, altura)'. Outros valores válidos são: 'a4', 'a4_landscape'. O valor padrão é Nenhum (tamanho do PDF = tamanho da imagem).

source: Set PDF metadata. Defaults to True (set creator, producer, modification date, etc).
pt_br: Definir metadados do PDF. O valor padrão é Verdadeiro (define criador, produtor, data de modificação, etc).

source: PDF generation
pt_br: Geracao de PDF

source: Convert a image file to a different format.
pt_br: Converter um arquivo de imagem para um formato diferente.

source: Image quality. Valid values are between 1-100.
pt_br: Qualidade da imagem. Valores validos estao entre 1-100.

source: Image convertion
pt_br: Conversão FFMpeg

source: Rotate a image file (clockwise or anti-clockwise).
pt_br: Girar um arquivo de imagem (horário ou anti-horário).

source: Rotation in degrees. Valid values are between -360 (anti-clockwise rotation) and 360 (clockwise rotation).
pt_br: Rotação em graus. Os valores válidos estão entre -360 (rotação anti-horária) e 360 (rotação horária).

source: use the same input file as output name
pt_br: usar o mesmo arquivo de entrada como nome de saída

source: with _rotated at the end)
pt_br: com _rotated no final)

source: Image rotation
pt_br: Rotacao de imagem

source: Mirror an image file (vertically or horizontally).
pt_br: Espelhar um arquivo de imagem (vertical ou horizontalmente).

source: Axis. Valid values are 'x' (mirror horizontally) or 'y' (flip vertically).
pt_br: Eixo. Valores válidos são 'x' (espelhar horizontalmente) ou 'y' (virar verticalmente).

source: with _mirrored at the end)
pt_br: com _mirrored no final)

source: Image mirroring
pt_br: Espelhamento de imagem

source: Security commands
pt_br: Comandos de segurança

source: Repair (lightly) corrupted PDF files (requires QPDF external library).
pt_br: Reparar arquivos PDF corrompidos (ligeiramente) (requer a biblioteca externa QPDF).

source: with _repaired.pdf at the end)
pt_br: com _repaired.pdf no final)

source: Password used to open protected file. Defaults to None (do not decrypt).
pt_br: Senha usada para abrir arquivo protegido. O padrão é None (não descriptografar).

source: Compress output PDF file (losslessly). Defaults to True (compress).
pt_br: Compactar arquivo PDF de saída (sem perda). O padrão é True (compactar).

source: Repair PDF
pt_br: Reparar PDF

source: Merge (join) input PDFs into a single PDF file.
pt_br: Mesclar (juntar) PDFs de entrada em um único arquivo PDF.

source: Merge files "input_file1.pdf" and "input_file2.pdf" into "output_file.pdf"
pt_br: Mesclar arquivos "input_file1.pdf" e "input_file2.pdf" em "output_file.pdf"

source: Merge protected PDF "input_file1.pdf" with password "unlock_password" with unprotected file "input_file2.pdf"
pt_br: Mesclar PDF protegido "input_file1.pdf" com senha "unlock_password" com arquivo não protegido "input_file2.pdf"

source: If file is protected, provide its password using the format `"filepath:password"`
pt_br: Se o arquivo for protegido, forneça sua senha usando o formato `"caminho_arquivo:senha"`

source: use the same input file of 1st file as output name
pt_br: usar o mesmo arquivo de entrada do 1º arquivo como nome de saída

source: with _merged.pdf at the end)
pt_br: com _merged.pdf no final)

source: Invalid filepath format
pt_br: Formato de caminho de arquivo inválido

source: Valid format is 'filepath:password' or 'filepath'
pt_br: O formato válido é 'caminho_arquivo:senha' ou 'caminho_arquivo'

source: Merge pages
pt_br: Mesclar páginas

source: Split PDF pages into several 1-page PDFs.
pt_br: Dividir páginas PDF em vários PDFs de 1 página.

source: For every PDF page, a new single page PDF will be created using the format `output_file_X.pdf`, where X is the page number.
pt_br: Para cada página do PDF, um novo PDF de uma página será criado usando o formato `output_file_X.pdf`, onde X é o número da página.

source: Split pages of input_file.pdf into output_file_X.pdf files
pt_br: Dividir páginas de input_file.pdf em arquivos output_file_X.pdf

source: For every PDF page, generate a "input_file_X.pdf" file
pt_br: Para cada página do PDF, gerar um arquivo "input_file_X.pdf"

source: Output file path
pt_br: Caminho do arquivo de saída

source: Split pages
pt_br: Dividir páginas

source: Extract specific pages from a PDF.
pt_br: Extrair páginas específicas de um PDF.

source: Extract pages 1 to 2, 4 and 6
pt_br: Extrair páginas 1 a 2, 4 e 6

source: with _extracted.pdf at the end)
pt_br: com _extracted.pdf no final)

source: Pages to extract (comma-separated list). Format "page_num" or "start-end".
pt_br: Páginas para extrair (lista separada por vírgulas). Formato "número_página" ou "início-fim".

source: Pages to extract [comma-separated list] (e.g., 1-3, 7)
pt_br: Páginas para extrair [lista separada por vírgulas] (exemplo: 1-3, 7)

source: Invalid page instruction
pt_br: Instrução de página inválida

source: Valid format is 'begin-', 'begin-end', 'page_num'
pt_br: O formato válido é 'início-', 'início-fim', 'número_página'

source: Invalid begin-end page interval
pt_br: Intervalo de páginas início-fim inválido

source: End Page < Begin Page
pt_br: Página final < Página inicial

source: Extract pages
pt_br: Extrair páginas

source: Rotate PDF pages (clockwise or anti-clockwise).
pt_br: Rotacionar páginas PDF (horário ou anti-horário).

source: Rotate page 1 by 180 degress
pt_br: Rotacionar página 1 por 180 graus

source: Rotate page 5-7 by 90 degress, 9 by -90 degrees, 10-15 by 180 degrees
pt_br: Rotacionar página 5-7 por 90 graus, 9 por -90 graus, 10-15 por 180 graus

source: List of pages to rotate. Format ``"page:rotation"`` or ``"start-end:rotation"`` or ``"start-:rotation"`` ...
pt_br: Lista de páginas para rotacionar. Formato ``"página:rotacionar"`` ou ``"início-fim:rotacionar"`` ou ``"início-:rotacionar"`` ...

source: with _rotated.pdf at the end)
pt_br: com _rotated.pdf no final)

source: Invalid rotation instruction
pt_br: Instrução de rotação inválida

source: Valid format is 'begin-end:degree' or 'page:degree'
pt_br: O formato válido é 'início-fim:grau' ou 'página:grau'

source: Rotate pages
pt_br: Rotacionar páginas

source: Protect PDF file with a password (create encrypted PDF file).
pt_br: Proteger arquivo PDF com senha (criar arquivo PDF criptografado).

source: Owner password for encryption. Owner has ALL PERMISSIONS in the output PDF file.
pt_br: Senha do proprietário para criptografia. O proprietário tem TODAS AS PERMISSÕES no arquivo PDF de saída.

source: Owner password for encryption (password will not be displayed, for your safety)
pt_br: Senha do proprietário para criptografia (senha não será exibida, por sua segurança)

source: with _encrypted.pdf at the end)
pt_br: com _encrypted.pdf no final)

source: User password for encryption. User has ONLY THE PERMISSIONS specified in the arguments. Defaults to None (user and owner password are the same).
pt_br: Senha do usuário para criptografia. O usuário tem SOMENTE AS PERMISSÕES especificadas nos argumentos. O padrão é None (senha de usuário e proprietário são as mesmas).

source: Decrypt password used to open protected file. Defaults to None (do not decrypt).
pt_br: Senha de descriptografia usada para abrir arquivo protegido. O padrão é None (não descriptografar).

source: User can add/modify annotations (comments, highlight text, etc) and interactive forms. Default to False (not set).
pt_br: O usuário pode adicionar/modificar anotações (comentários, destacar texto, etc) e formularios interativos. O padrão é False (não configurado).

source: User can fill form fields (subset permission of --annotate). Default to False (not set).
pt_br: O usuário pode preencher campos de formulário (permissão de subconjunto de --annotate). O padrão é False (não configurado).

source: User can modify the document (e.g., add / edit text, add / edit images, etc). Default to False (not set).
pt_br: O usuário pode modificar o documento (por exemplo, adicionar/editar texto, adicionar/editar imagens, etc). O padrão é False (não configurado).

source: User can insert, delete, or rotate pages (subset of --modify). Default to False (not set).
pt_br: O usuário pode inserir, excluir ou rotacionar páginas (subconjunto de --modify). O padrão é False (não configurado).

source: User can copy text/images. Default to False (not set).
pt_br: O usuário pode copiar texto/imagens. O padrão é False (não configurado).

source: User can use screen readers for accessibility. Default to True (allow).
pt_br: O usuário pode usar leitores de tela para acessibilidade. O padrão é True (permitir).

source: User can print (low quality). Defaults to True (allow).
pt_br: O usuário pode imprimir (baixa qualidade). O padrão é True (permitir).

source: User can print (high quality). Requires --allow-print. Defaults to True (allow).
pt_br: O usuário pode imprimir (alta qualidade). Requer --allow-print. O padrão é True (permitir).

source: User has ALL PERMISSIONS. If set, it overrides all other permissions. Defaults to False (not set).
pt_br: O usuário tem TODAS AS PERMISSÕES. Se configurado, substitui todas as outras permissões. O padrão é False (não configurado).

source: Encryption algorithm used. Valid options are RC4-40, RC4-128, AES-128, AES-256-R5, or AES-256. Defaults to AES-256 (for enhanced security and compatibility).
pt_br: Algoritmo de criptografia usado. Opções válidas são RC4-40, RC4-128, AES-128, AES-256-R5 ou AES-256. O padrão é AES-256 (para maior segurança e compatibilidade).

source: Encryption
pt_br: Criptografia

source: Remove password protection from a PDF file (create decrypted PDF file).
pt_br: Remover proteção por senha de um arquivo PDF (criar arquivo PDF descriptografado).

source: Password used for decryption.
pt_br: Senha usada para descriptografar.

source: Password for decryption (password will not be displayed, for your safety)
pt_br: Senha para descriptografar (senha não será exibida, por sua segurança)

source: with _decrypted.pdf at the end)
pt_br: com _decrypted.pdf no final)

source: Decryption
pt_br: Descriptografar

source: Context menu
pt_br: Menu de contexto

source: Installs app context menu (right click in Windows Explorer).
pt_br: Instala o menu de contexto do aplicativo (clique com o botão direito no Windows Explorer).

source: Installing app context menu in Windows Explorer
pt_br: Instalando o menu de contexto do aplicativo no Windows Explorer

source: for all users
pt_br: para todos os usuários

source: for current_user ONLY
pt_br: somente para o usuário atual

source: Restarting explorer.exe
pt_br: Reiniciando o explorer.exe

source: Context Menu Install
pt_br: Instalação do Menu de Contexto

source: Uninstalls app context menu (right click in Windows Explorer).
pt_br: Desinstala o menu de contexto do aplicativo (clique com o botão direito no Windows Explorer).

source: Removing app context menu from Windows Explorer
pt_br: Removendo o menu de contexto do aplicativo do Windows Explorer

source: Context Menu Uninstall
pt_br: Desinstalação do Menu de Contexto

source: Executable
pt_br: Executável

source: Marking dependency
pt_br: Marcando dependência

source: for installation
pt_br: para instalação

source: Package manager is not supported on
pt_br: Gerenciador de pacotes não é suportado em

source: Installing package manager
pt_br: Instalando gerenciador de pacotes

source: Installing missing dependencies
pt_br: Instalando dependências ausentes

source: Must be a bool or None.
pt_br: Deve ser um bool ou None.

source: Must be a positive integer.
pt_br: Deve ser um número inteiro positivo.

source: Invalid type
pt_br: Tipo inválido

source: for
pt_br: para

source: Valid values are Iterable | str | None
pt_br: Valores válidos são Iterable | str | None

source: Unsupported format
pt_br: Formato não suportado

source: Supported formats are
pt_br: Formatos suportados são
